app/controllers/homes_controller.rb

SELECT "homes".* FROM "homes"
SELECT "menus".* FROM "menus"
---
  def index
    @home = Home.all
    @menus = Menu.all

INSERT INTO "homes" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", 2017-03-23 17:37:42 UTC], ["updated_at", 2017-03-23 17:37:42 UTC]]
---
  def create
    @home = Home.new(home_params)

    respond_to do |format|
      if @home.save

DELETE FROM "homes" WHERE "homes"."id" = ?  [["id", 2]]
---
  def destroy
    @home.destroy

SELECT  "homes".* FROM "homes" WHERE "homes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_home
      @home = Home.find(params[:id])